app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @categories = Category.all
    @set = Setting.find(1)